АТДЛК/src/Documents/АктЭкспедитора/АктЭкспедитора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктЭкспедитора</name>
  <basedOn>Document.ЗаявкаКлиента</basedOn>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

АТДЛК/src/Documents/АктЭкспедитора/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)
	ЗаполнитьДанныеПеревозчикаНаСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПеревозчикаНаСервер();
	Объект.Клиент = Объект.Заявка.Клиент;
	Объект.Сумма = Объект.Заявка.Сумма;
КонецПроцедуры
